[{"FIRSTNAME":"Kaye","EMPLOYEE_BLURB":"Kaye comes to us with extensive experience within the customer service industry. Throughout her 27 years of customer service experience, she served 13 years in the Air Force, worked within the restaurant and hospitality industry, and spent her last eight years as a customer service representative and sales coordinator for a newspaper company. Born in Virginia, Kaye moved to South Carolina in 1977. Basically, she'll do anything to be outside; yes, even yard work. And in what may be the greatest example of yin and yang, she owns both a poodle and a Harley.","MANAGER":0,"EMPLOYEE_TITLE":"Customer Service Supervisor","DEPARTMENT_NAME":"Sales & Customer Service","EMAIL":"kaye.farinelli@smokingpipes.com","EMPLOYEE_PICTURE":"kaye_farinelli2.jpg","CELL_PHONE":"","ADMIN_ID":1011,"OFFICE_PHONE":123.0,"LASTNAME":"Farinelli"},{"FIRSTNAME":"Greg","EMPLOYEE_BLURB":"Greg has lived in the Myrtle Beach area since 1988, certainly long enough to be considered native, and has spent much of that time with his wife, Cheryl. He has earned an AS in Computer Programming, and has worked in the industry as a Programmer and Computer Tech for over eight years. A food connoisseur, he loves mac and cheese and an elegant blend of coffee and energy drinks. He likes puppies and enjoys long walks on the beach.","MANAGER":1,"EMPLOYEE_TITLE":"Sr. Application Developer ","DEPARTMENT_NAME":"Operations","EMAIL":"greg.marines@laudisi.com","EMPLOYEE_PICTURE":"greg_marines.jpg","CELL_PHONE":"","ADMIN_ID":1072,"OFFICE_PHONE":"","LASTNAME":"Marines"},{"FIRSTNAME":"Antonio","EMPLOYEE_BLURB":"After more than seven years of direct involvement in Laudisi Enterprises, and as VP of Sales for four years, Tony left at the end of 2009 to continue to pursue his 'education' in Atlanta, GA. Forgive us for being skeptical, but having received his reports of the co-ed population of Atlanta, we're now expecting his thesis to be entitled \"The Biological Implications of Postmodern Anthropological Rituals in Atlanta, GA: A Case Study\". Tony managed day-to-day operations at Smokingpipes.com for two years, so we're constantly finding ourselves calling to ask questions, mostly beginning 'where the ____ is...'. He's also involved in strategic planning for the company, and joins us for major company events, such as the Chicago Pipe Show.","MANAGER":0,"EMPLOYEE_TITLE":"Vice Chairman, VP Emeritus","DEPARTMENT_NAME":"Management","EMAIL":"antonio.saintiague@smokingpipes.com","EMPLOYEE_PICTURE":"antonio_saintiague.jpg","CELL_PHONE":"","ADMIN_ID":1017,"OFFICE_PHONE":"","LASTNAME":"Saintiague"},{"FIRSTNAME":"Joshua","EMPLOYEE_BLURB":"Born in Arley, Alabama (roll tide), Joshua came to South Carolina in 2005 to start graduate school. He taught for seven years while he earned his PhD in early American history. While writing lectures and a dissertation which focused on the religious and cultural history of colonial America, Joshua found pipes to be his constant companions. What free time he had, he spent reading about pipes and tobacco, and restoring estates that he picked up in antique stores. He comes to us having taught on a post-doctoral fellowship at the University of South Carolina, and a background in wine sales. His interests include food and wine, cooking, reading and writing history, and a secret love of Victorian ghost stories, which are to be read by the light of an oil lamp and accompanied by a pipe, naturally.","MANAGER":0,"EMPLOYEE_TITLE":"General Manager","DEPARTMENT_NAME":"Management","EMAIL":"joshua.burgess@smokingpipes.com","EMPLOYEE_PICTURE":"Joshua_Burgess.jpg","CELL_PHONE":"","ADMIN_ID":1077,"OFFICE_PHONE":126.0,"LASTNAME":"Burgess"},{"FIRSTNAME":"Katharine","EMPLOYEE_BLURB":"","MANAGER":0,"EMPLOYEE_TITLE":"Data Entry Specialist","DEPARTMENT_NAME":"Merchandizing","EMAIL":"katharine.vance@smokingpipes.com","EMPLOYEE_PICTURE":"Katie_Vance.jpg","CELL_PHONE":"","ADMIN_ID":1110,"OFFICE_PHONE":"","LASTNAME":"Vance"},{"FIRSTNAME":"Bear","EMPLOYEE_BLURB":"Ron ‘Bear’ Graves was born in Landstuhl, West Germany (back when there was a West Germany) to parents who were serving in the US Army as psychiatric social workers. Shortly after returning stateside, Bear’s father joined the BIA as a social worker, which resulted in the family living on tribal land in Alaska and Arizona for the next ten years. It was in the former that Bear acquired his nickname; a village shaman told his father, through a translator, that his son’s totem was the bear, something that he had never encountered in a ‘gussak’ (a derisive term for the non-indigenous). The nickname stuck.\r\n\r\nAfter his honorable discharge from the US Army, Bear attended Arizona State for his undergraduate in business. It wasn’t until 1998 that Bear (in his words) “On a lark” entered a private medical college, graduating with a 3.96 GPA in 2002. While Bear’s overly-gregarious nature made him a natural in sales, his passions for writing and pipes combined, which led to his eventual hire as a principle copywriter for Smokingpipes.com in 4\/2005. Bear remained with SPC until 4\/2010, after which he spent the next 41 months freelance writing for other sites and Pipes & Tobacco Magazine. Bear’s return to Smokingpipes.com found him with different responsibilities in the company; as a Media & Content Specialist.\r\n\r\nBear’s interests include photography, technical scuba diving, spending as much time on his Harley as possible, and (of course) Viking hats.","MANAGER":0,"EMPLOYEE_TITLE":"Media & Content Specialist","DEPARTMENT_NAME":"Marketing","EMAIL":"bear.graves@smokingpipes.com","EMPLOYEE_PICTURE":"Bear_Graves5.jpg","CELL_PHONE":"","ADMIN_ID":1085,"OFFICE_PHONE":"","LASTNAME":"Graves"},{"FIRSTNAME":"Glen","EMPLOYEE_BLURB":"A Northerner, Glen came to South Carolina from Niagara Falls, NY, bringing with him over five years working in the tobacco industry. An old soul, he enjoys spending his free time sitting out on his porch, while he writes music or plays the guitar. Reading is another big hobby for Glen, especially on the subject of ancient cultures. He loves hanging out with his three-year-old German Shepherd named Ava.","MANAGER":0,"EMPLOYEE_TITLE":"Shipping & Receiving Associate","DEPARTMENT_NAME":"Shipping","EMAIL":"glen.reinard@corporate.laudisi.com","EMPLOYEE_PICTURE":"Glen_Reinard.jpg","CELL_PHONE":"","ADMIN_ID":1105,"OFFICE_PHONE":105.0,"LASTNAME":"Reinard"},{"FIRSTNAME":"Sykes","EMPLOYEE_BLURB":"To know Sykes is to know that his interests lie primarily in pipes, technology, and...the 11th century Mediterranean? Born into an academic family, Sykes entered college assuming he would continue in that tradition. But life has a funny way of turning a history major from Vanderbilt expecting a career in academia, into a successful pipe retailer. During his freshman year of college in 1998, he was hired to work in a local tobacco shop. And thus began a love affair with tobacco and pipes that has not diminished across his years in the tobacco business. It was about this time that everyone thought that the internet would change everything and that company book values were measured in 'eyeballs', and Sykes saw an opportunity to combine his love of pipes and technology. He founded Smokingpipes.com in 2000 while he was still finishing up his degree, with the hopes that it could become a hub for pipe enthusiasts around the world to find high quality pipes. \"Technology should augment the personal touch, not replace it\" says Sykes, about almost everything (and occasionally entirely out of context during meetings, which is how we know he's been napping). He has experience in every capacity within the company, seeing as how he was the company in its infancy, but his main responsibilities include sales, vendor relations, overseeing finances and operations, coding, and making high level decisions about restaurants on business trips.","MANAGER":1,"EMPLOYEE_TITLE":"President & Founder","DEPARTMENT_NAME":"Management","EMAIL":"sykes.wilford@smokingpipes.com","EMPLOYEE_PICTURE":"sykes_wilford.jpg","CELL_PHONE":"843-267-6787","ADMIN_ID":1204,"OFFICE_PHONE":101.0,"LASTNAME":"Wilford"},{"FIRSTNAME":"Brandon","EMPLOYEE_BLURB":"Brandon’s fascination with pipe smoking began as a young boy, far before he actually smoked a single bowl. His grandfather, a Norwegian shoemaker, kept his tobacco in an elaborate silver box, from which emanated an aroma so powerful Brandon would never forget it. Years later Brandon began his own pipe journey when two of his friends purchased him his first pipe. Over time, his hobby turned into an obsession - one that in turn led him to leave his career as an executive for a Missouri-based financial institution and move his wife, Cara, and their two children Jaylen and Fin to South Carolina in order to join the Laudisi team.","MANAGER":1,"EMPLOYEE_TITLE":"General Manager, LDG","DEPARTMENT_NAME":"Laudisi Distribution Group","EMAIL":"brandon.bellegarde@laudisi.com","EMPLOYEE_PICTURE":"brandon_bellegarde.jpg","CELL_PHONE":"","ADMIN_ID":1064,"OFFICE_PHONE":115.0,"LASTNAME":"Bellegarde"},{"FIRSTNAME":"Jessica","EMPLOYEE_BLURB":"She was born in Pennsylvania and raised an Army Brat, but Jessica is a Southern girl at heart, having lived on the Grand Strand for the last 17 years. After spending ten years as a Volunteer Firefighter and 911 Dispatcher, she decided to start a new chapter working with Smokingpipes.com and going back to school for Graphic Design. She's extremely organized and smart, but it's her positive attitude and smile that we love most about Jessica. When she isn't hard at work, Jessica and her best friend\/husband, TJ, enjoy travelling to new places, trying unique foods, and craft brews. She also loves the Pittsburgh Steelers, her two dogs (and animals in general), the History Channel, and putting exclamation points at the end of every sentence!!!","MANAGER":0,"EMPLOYEE_TITLE":"Assistant Manager","DEPARTMENT_NAME":"Laudisi Distribution Group","EMAIL":"jessica.brady@smokingpipes.com","EMPLOYEE_PICTURE":"jessica_brady.jpg","CELL_PHONE":"","ADMIN_ID":1100,"OFFICE_PHONE":"","LASTNAME":"Brady"},{"FIRSTNAME":"Jonathan","EMPLOYEE_BLURB":"Jonathan came to us from Savinelli USA, the former stateside distributor of the fine Italian smoking pipes. His career has consisted of selling all sorts of things, from beer to hospital beds to briar pipes - the latter of which easily proved to be the most interesting industry. He enjoys nothing more than a beer and a pipe in front of the fire with a geeky science fiction novel. You also might recognize him from his recurring role in Old Spice commercials. If you see him at a trade show please come up and say hello.","MANAGER":0,"EMPLOYEE_TITLE":"Sales Executive","DEPARTMENT_NAME":"Laudisi Distribution Group","EMAIL":"jonathan.turner@laudisi.com","EMPLOYEE_PICTURE":"Jonathan_captneasypants_turner.jpg","CELL_PHONE":"","ADMIN_ID":1075,"OFFICE_PHONE":106.0,"LASTNAME":"Turner"},{"FIRSTNAME":"Romeo","EMPLOYEE_BLURB":"Romeo has called some amazing cities \"home.\" Originally from Bucharest, Romania, he has also lived in Sélestat on the German boarder of France, St. Augustine, Ft. Knox, Ancorage, and Spartanburg, before settling here on the boarder of Coastal North and South Carolina. Romeo's hobby is not only pipe smoking, but also cleaning and restoring. When he isn't at what he refers to as his dream job, or doing other pipe-related activities, he enjoys taking his daughter, Georgiana, to Ocean Isle Beach for walks and star gazing. Good food is in their genes, he says. The two often cook traditional Romanian food together, since nothing tastes better to him than the food he grew up with.","MANAGER":0,"EMPLOYEE_TITLE":"Pipe Restorer","DEPARTMENT_NAME":"Estates","EMAIL":"romeo.stan@smokingpipes.com","EMPLOYEE_PICTURE":"Romeo_Stan.jpg","CELL_PHONE":"","ADMIN_ID":1084,"OFFICE_PHONE":118.0,"LASTNAME":"Stan"},{"FIRSTNAME":"Andrew","EMPLOYEE_BLURB":"Originally from the foothills of North Carolina, Andrew, or “Andy,” grew up on a tobacco farm—where he watched his great grandfather cure and prime Virginias as a boy. Naturally, he soon developed a love for pipes and pipe tobacco. After taking up the hobby full-time during his undergrad at UNC Chapel Hill, Andy searched for a way to consolidate his love for pipes and his ambitions as a writer. Luckily his search led him across state lines to join us here at Smokingpipes.com. As a bilingual writer and Hemingway enthusiast, he enjoys both reading and writing short-stories in English and Spanish. He has developed an addiction to buying musical instruments; his favorite of which is the banjolele. His musical interests include Latin Reggae and Bluegrass—and, well, everything in between. Andy loves Spanish food, and since his return from Seville, Spain in 2012, has been tirelessly searching for jamón ibérico. When he’s not writing, he enjoys gardening, tea sipping, coffee gulping, traveling, learning new languages and watching his beard grow.","MANAGER":0,"EMPLOYEE_TITLE":"Copywriter","DEPARTMENT_NAME":"Marketing","EMAIL":"andrew.wike@corporate.laudisi.com","EMPLOYEE_PICTURE":"Andrew_Wike.jpg","CELL_PHONE":"","ADMIN_ID":1108,"OFFICE_PHONE":"","LASTNAME":"Wike"},{"FIRSTNAME":"Dave","EMPLOYEE_BLURB":"Dave relocated to Little River with his wife Patty from the ski resort area just southeast of Pittsburgh, PA in 1995, following an experience with a defective snow shovel which he chose to interpret as a \"divine omen\" to seek warmer climes. \r\n<br><br>\r\nDave has many years experience in industrial machinery and heavy mechanics, stretching back to his first job at WABCO in 1971. In 1987 he thought he would try his hand at a Mack Truck distributor because they were smaller than trains, and they let him drive them. When he saw an ad for a job at a \"pipe shop\" in May of 2011, he admits he didn’t realize the kind of pipes they meant until he got to the store. They took a big chance and hired him anyway, and Dave now enjoys the easy life, smoking his briar at work and talking to customers. He is very happy that most of <em>these<\/em> pipes only weigh a few ounces and enjoys “picking” orders for website customers from all over the world. He's even taken to using his motorcycle to shuttle items from the warehouse for our \"brick & mortar\" customers. \r\n<br><br>\r\nAs a personal goal, Dave has set out to make sure he samples each of the vast number of pipe tobaccos the store has available as part of his “bucket list”. Of course, that will no doubt take many, many years, as the shop’s tobacco inventory is quite extensive and new products are coming in all the time. When you visit Low Country, be sure to ask Dave what he thinks you should try. He guarantees you’ll like his suggestions.","MANAGER":0,"EMPLOYEE_TITLE":"Retail Sales Supervisor","DEPARTMENT_NAME":"Low Country Pipe & Cigar","EMAIL":"dave.cunningham@smokingpipes.com","EMPLOYEE_PICTURE":"dave_cunningham.jpg","CELL_PHONE":"","ADMIN_ID":1028,"OFFICE_PHONE":112.0,"LASTNAME":"Cunningham"},{"FIRSTNAME":"Jerome","EMPLOYEE_BLURB":"Jerome is originally from Charleston, SC. He and his wife Vanessa moved to Little River from Raleigh, NC two years go with their two dogs. In addition to being a cigar enthusiast, he is also developing an appreciation for pipes and fine tobacco. When he isn’t busy working, Jerome enjoys spending time with his family, playing golf, and watching sports.","MANAGER":0,"EMPLOYEE_TITLE":"Retail Sales Associate","DEPARTMENT_NAME":"Low Country Pipe & Cigar","EMAIL":"jerome.nelson@smokingpipes.com","EMPLOYEE_PICTURE":"jerome_nelson.jpg","CELL_PHONE":"","ADMIN_ID":1101,"OFFICE_PHONE":112.0,"LASTNAME":"Nelson"},{"FIRSTNAME":"Ronald","EMPLOYEE_BLURB":"A native New Yorker, Ron moved to Myrtle Beach when his parents retired in Late 2005 halfway through his Sophomore year of high school.\r\n\r\nRon has three years of experience in the Cigar Industry. A tobacco enthusiast, it was his grandfather, who has smoked cigars and pipes as long as Ron can remember, who initially stoked his interest in cigars and tobacco. After having a cigar for the first time with a few friends in his early college years, he was immediately hooked. Eager to learn as much as he could about the industry and the different types of tobacco, he became heavily involved in cigars. When he heard about the opening at Low Country through a mutual cigar smoking friend, he knew he had to apply. It's rare to see him without a cigar in his hand, though he has recently learned to appreciate the art of smoking pipes. In his free time, Ron enjoys sampling fine single malt scotch and writing.","MANAGER":0,"EMPLOYEE_TITLE":"Retail Sales Associate","DEPARTMENT_NAME":"Low Country Pipe & Cigar","EMAIL":"ronald.nunes@lowcountrypipeandcigar.com","EMPLOYEE_PICTURE":"Ron_Nunes.jpg","CELL_PHONE":"","ADMIN_ID":1106,"OFFICE_PHONE":112.0,"LASTNAME":"Nunes"},{"FIRSTNAME":"Hadassah","EMPLOYEE_BLURB":"Hadassah Hallman, also known as HaHa to her friends, can be easily identified by her gorgeous warming smile and easily remembered by her caring, cool, and cheerful personality. Hadassah was born in Panama and raised in South Carolina and Texas. She comes from a background in hospitality & tourism but desired a more peaceful environment, somewhere far away from tourists and ugly uniforms. Embracing how vastly different her new home at Smokingpipes.com is, she hopes to venture further into the pipe world. Hadassah is currently pursuing her degree in the Paralegal field. She is the proud mother of a brilliant daughter, who is just as quirky. Hadassah enjoys reading in the shower, binge bargain-shopping, comedies with happy endings, and horror movies that actually frighten her. Her favorite author is Stephen King and her favorite girl band is the Spice Girls.","MANAGER":0,"EMPLOYEE_TITLE":"Data Entry Specialist","DEPARTMENT_NAME":"Merchandizing","EMAIL":"hadassah.hallman@smokingpipes.com","EMPLOYEE_PICTURE":"Hadassah_Helina_Hallman.jpg","CELL_PHONE":"","ADMIN_ID":1102,"OFFICE_PHONE":"","LASTNAME":"Helina Hallman"},{"FIRSTNAME":"Calvin","EMPLOYEE_BLURB":"Calvin Miller was born in Saint Louis, Missouri to military parents. Imagine their surprise when he decided to pick up a colored pencil set instead of a cap gun. After graduating from Winthrop University with a degree in Visual Communications, he immediately immersed himself in everything to do with advancing technology and marketing trends. His passion is to continue to make art relevant in today’s growing mediums while making a ton of money. Calvin enjoys short walks on the beach, smacking while eating, Guinness, video gaming and watching Fresh Prince of Bel-Air reruns. Calvin dislikes splinters and videos about parasitic organisms.","MANAGER":0,"EMPLOYEE_TITLE":"Marketing Manager","DEPARTMENT_NAME":"Marketing","EMAIL":"Calvin.miller@smokingpipes.com","EMPLOYEE_PICTURE":"calvin_miller.jpg","CELL_PHONE":"","ADMIN_ID":1103,"OFFICE_PHONE":124.0,"LASTNAME":"Miller"},{"FIRSTNAME":"Shane","EMPLOYEE_BLURB":"Born and raised in San Diego, Shane and his fiancé, Lisette, plus their Beagle, Bubba (who is a good boy), relocated to South Carolina to join us at Smokingpipes.com. It was when we asked his hobbies and he responded: \"whiskey, tobacco, writing, moving across the country, and listing my hobbies,\" that we knew we would get along just fine. He plays several instruments adequately, but maybe none masterfully, and loves the music of David Bowie, Ornette Coleman, and Rachmaninoff. His favorite foods include albacore, espresso, Laphroaig of any variety, McConnell's Scottish Flake, watermelon, rye (both marbled, and distilled), and soft-boiled quail eggs. But especially clam chowder. He proudly supports Chelsea Football Club, and Boba Fett is, hands down, his favorite bounty hunter.","MANAGER":0,"EMPLOYEE_TITLE":"Customer Service Associate","DEPARTMENT_NAME":"Sales & Customer Service","EMAIL":"shane.ireland@corporate.laudisi.com","EMPLOYEE_PICTURE":"Shane_Ireland.jpg","CELL_PHONE":"","ADMIN_ID":1107,"OFFICE_PHONE":127.0,"LASTNAME":"Ireland"},{"FIRSTNAME":"Raphael","EMPLOYEE_BLURB":"Raphael has an outgoing personality. He is never seen without a big smile and humorous, positive attitude. Another repentant New Yorker to move South and join the Smokingpipes family, Raphael has been a pipe smoker for over five years. He is a hobby liturgist, a collector of prayer books, Zappa records, and pens, and refers to himself as a \"geek\" for Queen. He is owned by a crazy Jack Russell named Brendan.","MANAGER":0,"EMPLOYEE_TITLE":"Pipe Restorer","DEPARTMENT_NAME":"Estates","EMAIL":"raphael.fiedler@smokingpipes.com","EMPLOYEE_PICTURE":"raphael_fiedler.jpg","CELL_PHONE":"","ADMIN_ID":1109,"OFFICE_PHONE":"","LASTNAME":"Fiedler"},{"FIRSTNAME":"Ted","EMPLOYEE_BLURB":"Having studied art and poetry at CalArts in Valencia, California, Ted admits freely that his initial impulse to pick up a pipe had more to do with cultivating his pretentiousness as a blossoming young artist than it had to with his desire to smoke fine tobacco. Fastforward ten years and Ted's thoughts on pipes and tobacco are as sober as his critique of conceptual art. After years in a local rock band in Stockton, California, and six years with Starbucks Coffee, Ted came into the company as Sales Manager. Presently, as Chief Operating Officer, Ted supervises the various divisions that compose Laudisi Enterprises. This means he has a hand in Smokingpipes.com, Laudisi Distribution, Cornell & Diehl, our Marketing department, our Shipping department, and our IT department. He’s a pretty busy guy anymore.","MANAGER":1,"EMPLOYEE_TITLE":"Chief Operating Officer","DEPARTMENT_NAME":"Management","EMAIL":"ted.swearingen@smokingpipes.com","EMPLOYEE_PICTURE":"ted_swearingen2.jpg","CELL_PHONE":"209-298-4645","ADMIN_ID":1202,"OFFICE_PHONE":125.0,"LASTNAME":"Swearingen"},{"FIRSTNAME":"Cyndy","EMPLOYEE_BLURB":"A native of Geneseo of western New York, Cyndy moved down to Georgia following college, working in the restaurant industry for several years before becoming a full-time mom to three (wonderful) children. Later on down the road she would make use of her acquired child-wrangling skills as a school bus driver, then, following that, as a customer service representative. Eventually she decided a change of scenery was in store, and, like so many with a similar urge, she chose South Carolina as her destination.","MANAGER":0,"EMPLOYEE_TITLE":"Update Supervisor","DEPARTMENT_NAME":"Merchandizing","EMAIL":"cyndy.smith@smokingpipes.com","EMPLOYEE_PICTURE":"cyndy_smith.jpg","CELL_PHONE":"","ADMIN_ID":1039,"OFFICE_PHONE":113.0,"LASTNAME":"Smith"},{"FIRSTNAME":"Brenna","EMPLOYEE_BLURB":"Brenna has worked with Cornell and Diehl on and off for about five years, coming in to help as needed with large projects. When it came time to fill the enormous shoes of Mrs. Patty Tarler, Brenna was our natural choice. While Brenna runs the office and helps organize day to day operations, she’s never reticent to roll up her sleeves and get “hands on” with tinning and shipping. When not at work she is busy with her family. Husband Josh, and three kids; Grace, Henry, and Jacob keep her running with sports, church and day to day activities.","MANAGER":0,"EMPLOYEE_TITLE":"Administrative Assistant","DEPARTMENT_NAME":"Cornell & Diehl","EMAIL":"brenna.call@laudisi.com","EMPLOYEE_PICTURE":"Brenna_Call.jpg","CELL_PHONE":"","ADMIN_ID":1092,"OFFICE_PHONE":129.0,"LASTNAME":"Call"},{"FIRSTNAME":"Katie","EMPLOYEE_BLURB":"Katie works in the Marketing Department to ensure that your pipes, cigars, tobacco and accessories look as beautiful on the web as they do in person. Part of the Smokingpipes.com Jersey faction, Katie moved to South Carolina with her family when she was just two years old.","MANAGER":0,"EMPLOYEE_TITLE":"Staff Photographer","DEPARTMENT_NAME":"Marketing","EMAIL":"katie.ranalli@smokingpipes.com","EMPLOYEE_PICTURE":"katie_ranalli.jpg","CELL_PHONE":"","ADMIN_ID":1042,"OFFICE_PHONE":124.0,"LASTNAME":"Ranalli"},{"FIRSTNAME":"Keith","EMPLOYEE_BLURB":"Keith Toney was born in Marion in the western NC foothills. A life-long avid reader, he took up pipe smoking around 1990 when he was working as a historian\/licensed battlefield guide at Gettysburg NMP, thinking it fit the image, and to emulate two of his literary heroes: Mark Twain and Shelby Foote. While the pipe didn’t turn him into a literary giant, it did spur a passion for pipes and all things pipe related. By 1995 Keith was working in a tobacconist, and has been employed in the industry since that time. In 2005 an opportunity to return to his native western NC presented itself when a position came open at Cornell & Diehl, Inc. Keith is married and has two children and two grandchildren; when not spending time with them, he enjoys reading, American history, golf, and UNC Tarheel sports.","MANAGER":0,"EMPLOYEE_TITLE":"Sales Executive","DEPARTMENT_NAME":"Laudisi Distribution Group","EMAIL":"keith.toney@laudisi.com","EMPLOYEE_PICTURE":"Keith_Toney.jpg","CELL_PHONE":"","ADMIN_ID":1087,"OFFICE_PHONE":109.0,"LASTNAME":"Toney"},{"FIRSTNAME":"Mike","EMPLOYEE_BLURB":"Mike has been at Cornell and Diehl for five years. His job has changed many times over the years, always stepping up to the plate as company needs have required, and he now runs our tinning operations, as well as all of our shipping. When at home he likes to work on his many different car projects as well as helping others with his mechanical virtuosity on the side. He isn't all work, though. Mike also likes to relax at home and hang out with his cat Moxie.","MANAGER":0,"EMPLOYEE_TITLE":"Production Associate","DEPARTMENT_NAME":"Cornell & Diehl","EMAIL":"mike.woods@laudisi.com","EMPLOYEE_PICTURE":"mike_woods.jpg","CELL_PHONE":"","ADMIN_ID":1097,"OFFICE_PHONE":"","LASTNAME":"Woods"},{"FIRSTNAME":"Kathryn","EMPLOYEE_BLURB":"Kathryn, or \"Kat\" for short, is a South Carolina native who has been in the Myrtle Beach area over 14 years. Often accused of \"Facebook-ing too much,\" it's fitting that her work here revolves somewhat around social media. She also greatly enjoys patching together videos for YouTube, and helping showcase the updates. Having recently achieved her BA in English and MA in writing at Coastal Carolina University, she is looking forward to doing some creative writing in her off time, and not feeling the need to over-caffeinate. She also loves novels (magical-realism particularly), photography, Irish whiskey, and traveling with her husband, Dennis. Sadly, her love of travel has not given her the aptitude for direction. It is a well-known fact that she is often lost and surrounded by cats and Disney merchandise.","MANAGER":0,"EMPLOYEE_TITLE":"Assistant Marketing Manager","DEPARTMENT_NAME":"Marketing","EMAIL":"kathryn.mann@smokingpipes.com","EMPLOYEE_PICTURE":"kat_mann.jpg","CELL_PHONE":"","ADMIN_ID":1047,"OFFICE_PHONE":"","LASTNAME":"Mann"},{"FIRSTNAME":"Tracy","EMPLOYEE_BLURB":"Tracy and her husband David set out together to Myrtle Beach when they were both just nineteen and have made a pretty good run of it down here. David has owned and operated his own income tax and accounting practice since 1994, which Tracy continues to help out with part-time. She herself ran her own mortgage broker firm from 2003 to 2009, and her considerable experience in purchasing, accounting, and inventory control has quickly proven valuable here at Smokingpipes, where she enjoys being able to utilize her skills - not to mention our relaxed environment and the opportunity to learn the ins and outs of an industry that's entirely new to her. When they aren't busy with, well, business, she and her husband enjoy getting out and back to nature, camping and hiking with their three children.","MANAGER":0,"EMPLOYEE_TITLE":"Accounting Administrator","DEPARTMENT_NAME":"Operations","EMAIL":"tracy.berry@smokingpipes.com","EMPLOYEE_PICTURE":"tracy_berry.jpg","CELL_PHONE":"843-251-2728","ADMIN_ID":1058,"OFFICE_PHONE":102.0,"LASTNAME":"Berry"},{"FIRSTNAME":"Mathew","EMPLOYEE_BLURB":"Mathew is a transplant from Connecticut where he worked for Big Y Supermarkets and Fed-Ex. He received his degree in English from Eastern Connecticut State University. When not wrangling of inventory for Laudisi, Matthew enjoys baseball, alternative rock, cult television shows, and reading anything he can get his hands on.","MANAGER":0,"EMPLOYEE_TITLE":"Inventory Control Specialist","DEPARTMENT_NAME":"Corporate","EMAIL":"matt.johnson@laudisi.com","EMPLOYEE_PICTURE":"matt_johnson2.jpg","CELL_PHONE":"","ADMIN_ID":1083,"OFFICE_PHONE":117.0,"LASTNAME":"Johnson"},{"FIRSTNAME":"Thomas","EMPLOYEE_BLURB":"Thomas comes to us with over 20 years of sales experience in various areas: insurance, auto, and cellular services. An easy-going fellow, he enjoys getting to know his customers, what they like, and what they don't. It's rare to catch him without a pipe or cigar, but, when he isn't at work, his passions include golf and motorcycles. With his cheerful attitude and joking nature, you can always count on Thomas to lighten the mood.","MANAGER":0,"EMPLOYEE_TITLE":"Retail Sales Associate","DEPARTMENT_NAME":"Low Country Pipe & Cigar","EMAIL":"thomas.lovelace@smokingpipes.com","EMPLOYEE_PICTURE":"thomas_lovelace.jpg","CELL_PHONE":"","ADMIN_ID":1078,"OFFICE_PHONE":112.0,"LASTNAME":"Lovelace"},{"FIRSTNAME":"Dennis","EMPLOYEE_BLURB":"Dennis' interest in pipes grew from his history with woodworking and carpentry, both personally and through his family. He's joined us after an extensive career as a Firefighter, embracing the artistry of the pipe, but also hoping to incorporate his experience in structured management and organization. Dennis loves to travel, frequently dragging friends and family with him, and not only makes up for his wife's lack of navigational skills but enjoys total immersion in new places and cultures. He is also an amateur Irish historian and beverage aficionado.","MANAGER":0,"EMPLOYEE_TITLE":"Pipe Manager","DEPARTMENT_NAME":"Merchandizing","EMAIL":"dennis.mann@smokingpipes.com","EMPLOYEE_PICTURE":"Dennis_Mann2.jpg","CELL_PHONE":"","ADMIN_ID":1073,"OFFICE_PHONE":103.0,"LASTNAME":"Mann"},{"FIRSTNAME":"Adam","EMPLOYEE_BLURB":"Forgive the cliche', but Adam's passion for pipes definitely goes to 11. And you realize that when you ask him a question about pipe bits and his twenty minute answer doesn't include a comma or a breath. Adam's duties here include, but are not limited to, inspecting all new and estate pipes for drilling, fit and finish, construction, and cosmetic issues. He also enjoys writing weekly condition statements along with pipe descriptions, mainly estates. He is, to put it mildly, meticulous in his research and would rather quit smoking a pipe than sell something below quality to a fellow smoker. Adam is also a celebrated pipe maker, creating and crafting some of our more sought after pipes. He is an industrial design graduate of Purdue University, and has designed pieces such as office products, furniture and cars. Adam's future in pipes was cemented when, as a young child, he refused to watch Frosty the Snowman because he couldn't fathom why a snowman with a magic hat would choose a corncob pipe over a patent sandblast.","MANAGER":0,"EMPLOYEE_TITLE":"Estate Manager","DEPARTMENT_NAME":"Estates","EMAIL":"adam.davidson@smokingpipes.com","EMPLOYEE_PICTURE":"adam_davidson.jpg","CELL_PHONE":119.0,"ADMIN_ID":1018,"OFFICE_PHONE":"","LASTNAME":"Davidson"},{"FIRSTNAME":"Bill","EMPLOYEE_BLURB":"Bill has been living in the Low Country for 27 years which makes him the closest thing to a \"local\" that we have. Originally from Ohio, Bill has a Bachelor's degree in Business and over 16 years retail experience. A frequent cigar smoker, Bill also owned a beachfront bar for four years (we figured if he could handle that riff raff he would have no problem with the crowd that frequents our store.) Bill's pride and joy are his wife of 25 years, his two children and the Ohio State Buckeyes.","MANAGER":0,"EMPLOYEE_TITLE":"Retail Manager & Purchasing Manager","DEPARTMENT_NAME":"Low Country Pipe & Cigar","EMAIL":"bill.lloyd@smokingpipes.com","EMPLOYEE_PICTURE":"bill_lloyd.jpg","CELL_PHONE":"555-867-5309","ADMIN_ID":1008,"OFFICE_PHONE":114.0,"LASTNAME":"Lloyd"},{"FIRSTNAME":"Chris","EMPLOYEE_BLURB":"A graduate of Atlanta's Oglethorpe University, Chris Johnson relocated to the Myrtle Beach area with his wife Katy and their little daughter Maeve shortly before joining the Smokingpipes.com team, and has since become quite the budding pipe enthusiast. This latest pursuit joins his already long-running interests in surfing and the art of aquascaping. What's more, he's also followed in another great Smokingpipes.com employee tradition: Conspicuous beard-growing.","MANAGER":0,"EMPLOYEE_TITLE":"Lead Photographer","DEPARTMENT_NAME":"Marketing","EMAIL":"chris.johnson@smokingpipes.com","EMPLOYEE_PICTURE":"chris_johnson.jpg","CELL_PHONE":"","ADMIN_ID":1023,"OFFICE_PHONE":"","LASTNAME":"Johnson"},{"FIRSTNAME":"Eric","EMPLOYEE_BLURB":"Eric's humble beginnings with Smokingpipes.com started with data entry where his love of pipes grew and eventually merged with his creative writing talent. He now describes about 75% of the pipes on the and smoking accessories that go up on the website every week. Eric is another member of our New Jersey faction, and is a fan of smoking latakia, cheap cigars, and silence. In his own words, \"Animals adore me, women giggle school-girlishly at me, and men want to know what I could have possibly been thinking.\"","MANAGER":0,"EMPLOYEE_TITLE":"Senior Copywriter","DEPARTMENT_NAME":"Marketing","EMAIL":"eric.squires@smokingpipes.com","EMPLOYEE_PICTURE":"eric_squires2.jpg","CELL_PHONE":"","ADMIN_ID":1019,"OFFICE_PHONE":"","LASTNAME":"Squires"},{"FIRSTNAME":"John","EMPLOYEE_BLURB":"Originally from Mississippi, John found his way to South Carolina by way of his education; first receiving a bachelors in Fine Art\/Photography from Delta State and then his masters at Clemson. Finally realizing that he was born a pipe smoker (who knew?) during his first week of employment, John feels complete now that he has the outlet to nuture his newfound hobby. John is a movie buff, a cat person and a mediocre juggler. He also loves the taste of burnt cheese.","MANAGER":1,"EMPLOYEE_TITLE":"Creative Director","DEPARTMENT_NAME":"Marketing","EMAIL":"john.sutherland@smokingpipes.com","EMPLOYEE_PICTURE":"john_sutherland.jpg","CELL_PHONE":"","ADMIN_ID":1020,"OFFICE_PHONE":116.0,"LASTNAME":"Sutherland"},{"FIRSTNAME":"Janice","EMPLOYEE_BLURB":"Aside from her duties as a member of the shipping department, Janice is enjoying her introduction to the world of pipes, cigars and tobacco. After serving as a retail sales associate within our store, Janice now fulfills the duties of shipping supervisor, where she oversees the process by which all of your orders get to you in a timely manner. She and her husband came to the beach from the northern Chicago suburbs, preferring to experience snow through the magic of television.","MANAGER":0,"EMPLOYEE_TITLE":"Shipping & Receiving Supervisor","DEPARTMENT_NAME":"Shipping","EMAIL":"janice.haggie@smokingpipes.com","EMPLOYEE_PICTURE":"janice_haggie.jpg","CELL_PHONE":"","ADMIN_ID":1015,"OFFICE_PHONE":105.0,"LASTNAME":"Haggie"},{"FIRSTNAME":"Alyson R.","EMPLOYEE_BLURB":"Until mid-2011, Alyson was manager of the combined Merchandizing and Marketing departments. These days, she is our point person for recruiting, herding applicants through the interviewing process and new team member orientation. Although she has lived in the South since 2002 (leaving behind New Jersey), she refuses to eat grits or say \"y'all,\" though she has developed a fondness for sweet tea and fried chicken. She is a self-diagnosed ailurophile, but we secretly think she's just building a cat army. (Alyson, you shouldn't leave your \"literature\" in the copier.)","MANAGER":1,"EMPLOYEE_TITLE":"Recruiter","DEPARTMENT_NAME":"Corporate","EMAIL":"alyson.ranalli@smokingpipes.com","EMPLOYEE_PICTURE":"alyson_ranalli.jpg","CELL_PHONE":"","ADMIN_ID":1203,"OFFICE_PHONE":"","LASTNAME":"Wilford"},{"FIRSTNAME":"Ryota","EMPLOYEE_BLURB":"Ryota is our man in Tokyo. He handles customer service for our Japanese customers, providing the same service in Japanese that we offer in English from our main offices in South Carolina. An avid pipe man, Ryota fell in love with pipes while attending Keio University in Tokyo. Since then, he's become involved in pipe clubs and shows in Japan. We first met him at the Chicago Pipe Show in 2011 and he joined the team at the beginning of 2012. A California native, Ryota relocated to Japan to attend college, and now resides there helping to bridge the gap between Smokingpipes.com and its Japanese customers and suppliers.","MANAGER":0,"EMPLOYEE_TITLE":"Customer Service, Japan","DEPARTMENT_NAME":"Sales & Customer Service","EMAIL":"ryota.shimizu@smokingpipes.com","EMPLOYEE_PICTURE":"ryota_shimizu.jpg","CELL_PHONE":"","ADMIN_ID":1035,"OFFICE_PHONE":"","LASTNAME":"Shimizu"},{"FIRSTNAME":"Timothy","EMPLOYEE_BLURB":"Tim, along with his wife and son, moved to South Carolina in 2010 in order to be closer to family. They still miss Autumn in New England but family comes first, of course. In the past, he has been a U.S. Marine, as well as a correctional officer, so we know he'll be able to keep up with the fast pace of the Estate Restoration Department. His fascination with pipes extends as long as he can remember, \"If you have a problem in life, just sit back with a good pipe. The answer will surely come to you\".","MANAGER":0,"EMPLOYEE_TITLE":"Pipe Restorer","DEPARTMENT_NAME":"Estates","EMAIL":"tim.gagnon@smokingpipes.com","EMPLOYEE_PICTURE":"Timothy_Gagnon.jpg","CELL_PHONE":"","ADMIN_ID":1081,"OFFICE_PHONE":118.0,"LASTNAME":"Gagnon"},{"FIRSTNAME":"Kelly","EMPLOYEE_BLURB":"Kelly originally hails from Montgomery County, Maryland, and only relocated to South Carolina about a year previous to her joining the Smokingpipes team. Though she and her husband originally moved here to be closer to his grandparents, it's proven fortuitous for Kelly, someone who loves the color green (which we have plenty of), as well as wearing flip-flops -- something she'll do as far into winter (which we have very little of) as she can. In her spare time she enjoys just about all manner of music, thriller and horror novels and movies alike, cooking, and playing with and caring for her family dogs -- all half-dozen of them.","MANAGER":0,"EMPLOYEE_TITLE":"Photo Processing Specialist","DEPARTMENT_NAME":"Marketing","EMAIL":"kelly.runyon@smokingpipes.com","EMPLOYEE_PICTURE":"kelly_runyon.jpg","CELL_PHONE":"","ADMIN_ID":1067,"OFFICE_PHONE":"","LASTNAME":"Runyon"},{"FIRSTNAME":"Denis","EMPLOYEE_BLURB":"Denis comes to Smokingpipes.com most recently from his position as Maintenance Director for a senior assisted living community. For a decade or so before that, he was the Owner\/President of a home repair\/construction company. He is also a veteran of the Air Force (Law Enforcement Investigator) and has spent seven years as a 911 dispatcher. \r\nHailing from rural NJ, home for he and his wife, Kathleen, has included Wyoming, New Hampshire, Republic of Turkey, and now and forever, South Carolina. Although his children live in LA (son and wife) and Austin (daughter), Denis will tell you this: “We're not from the South, but we got here as soon as we could! We love it”. Since 2002 home has been a small house on a dirt road, with a couple acres and a pond, outside of Loris. He enjoys the “rural lifestyle” and target shooting in the back yard. \r\n“I will bring everything I have learned in customer service, efficiency, streamlining, and logistics to the Shipping Department. I was raised on a simple philosophy; “Do it right the first time”.","MANAGER":0,"EMPLOYEE_TITLE":"Shipping Manager","DEPARTMENT_NAME":"Shipping","EMAIL":"denis.riley@smokingpipes.com","EMPLOYEE_PICTURE":"denis_r.jpg","CELL_PHONE":"843-340-6559","ADMIN_ID":1080,"OFFICE_PHONE":105.0,"LASTNAME":"Riley"},{"FIRSTNAME":"Peter","EMPLOYEE_BLURB":"Following in the Smokingpipes tradition of unorthodox career paths, Pete Kogler capped off a twenty-six year long run as a touring musician by earning a business degree focusing on marketing and graphic design. (That's not to say he's stopped playing music, though; along with boating and fishing, it still makes up a healthy chunk of his free time.) And as a native of Buffalo, NY, Pete's furthermore added to our other great tradition, that of welcoming into our bosom those who have migrated (fled?) to the Myrtle Beach area from the Northeast.","MANAGER":0,"EMPLOYEE_TITLE":"Videographer","DEPARTMENT_NAME":"Marketing","EMAIL":"peter.kogler@smokingpipes.com","EMPLOYEE_PICTURE":"pete_kogler.jpg","CELL_PHONE":"843-333-6636","ADMIN_ID":1056,"OFFICE_PHONE":124.0,"LASTNAME":"Kogler"},{"FIRSTNAME":"Mark","EMPLOYEE_BLURB":"Comments? Questions? Straightforward, hardcore, no-nonsense customer service? Mark's your guy. His mission is to guarantee your experience with Smokingpipes.com is so good that you’ll want to have another experience with Smokingpipes.com. His genial manner and positive attitude are infectious around the office (which is a great change of pace in this era of bird and swine flu). Mark is yet another member of the New Jersey faction, but we don't hold that against him. Before Mark joined the SP.com team, he worked in the trucking and logistics industry where he was a Safety Director. His hobbies include music, movies, spending time at the beach, friends and family.","MANAGER":0,"EMPLOYEE_TITLE":"Customer Service Liaison","DEPARTMENT_NAME":"Sales & Customer Service","EMAIL":"mark.pluta@smokingpipes.com","EMPLOYEE_PICTURE":"mark_pluta.jpg","CELL_PHONE":"","ADMIN_ID":1009,"OFFICE_PHONE":110.0,"LASTNAME":"Pluta"},{"FIRSTNAME":"Aaron","EMPLOYEE_BLURB":"Add yet another new name to our (increasingly long) list of NY\/NJ\/Philly area expatriates: Aaron Young. Aaron comes to us from Piscataway, NJ, and confesses to being a huge TV and movie buff, as well as a huge fanatic for football, and the Raiders in particular. He made the move down here to the Myrtle Beach area's warmer climes on the advice of our own Bill Westfield, and has not regretted it. Along with Janice, Deborah, and Cassidy, he helps see to it that all your orders are put together, packed up safely, and shipped out with efficiency.","MANAGER":0,"EMPLOYEE_TITLE":"Shipping & Receiving Associate","DEPARTMENT_NAME":"Shipping","EMAIL":"aaron.young@smokingpipes.com","EMPLOYEE_PICTURE":"aaron_young.jpg","CELL_PHONE":"","ADMIN_ID":1041,"OFFICE_PHONE":105.0,"LASTNAME":"Young"},{"FIRSTNAME":"Lisa","EMPLOYEE_BLURB":"If one were to idly wander through the Smokingpipes offices, your first impression of Lisa might simply be that of a quiet, diminutive, friendly lady sitting behind a contrastingly large desk. The reality is that she sits behind that large desk because she is the rock of Smokingpipes - while Sykes is brainstorming with John or Ted, or trotting off overseas to meet with pipemakers and work out some crazy deal, Lisa's the one making sure we have things like electricity, shelter, fresh coffee beans by the sack-full, and paychecks. <br><br>Originally from Reading, PA, Lisa relocated to South Carolina on account of her love of the beach, and ascended to her current senior position (rather literally) from being manager of our first-floor brick & mortar pipe and cigar shop, Low Country Pipe and Cigar. <br><br>Aside from her official duties as the Smokingpipes matriarch, Lisa also serves as our resident expert on all matter Disney-related, as evidenced by the hefty dream-vacation itinerary she provided Adam with when he took his wife to Disneyworld. (And which turned out, by all accounts indeed, to be a rousing success.)","MANAGER":1,"EMPLOYEE_TITLE":"Vice President & Operations Manager","DEPARTMENT_NAME":"Management","EMAIL":"lisa.mogel@smokingpipes.com","EMPLOYEE_PICTURE":"Lisa_Mogel2.jpg","CELL_PHONE":"843-855-5099","ADMIN_ID":1201,"OFFICE_PHONE":111.0,"LASTNAME":"Mogel"},{"FIRSTNAME":"Tammy","EMPLOYEE_BLURB":"One could call Tammy a shipping and receiving expert, since it has been her specialty for about ten years. She was inspired to pack her crazy hat collection and leave small-town Pennsylvania life after being exposed to two blizzards in only three days. She can handle the cold for a good cause though; frequently volunteering for activities like the Polar Plunge in support of the American Cancer Society, Breast Cancer Awareness, and the Special Olympics. She has two children, Davika and Branson, and a pet teacup pig named Harlee.","MANAGER":0,"EMPLOYEE_TITLE":"Shipping & Receiving Associate","DEPARTMENT_NAME":"Shipping","EMAIL":"tammy.hall@smokingpipes.com","EMPLOYEE_PICTURE":"tammy.jpg","CELL_PHONE":"","ADMIN_ID":1069,"OFFICE_PHONE":105.0,"LASTNAME":"Hall"},{"FIRSTNAME":"Joe","EMPLOYEE_BLURB":"As the second person we've hired with the name Aaron J. Young, we're lucky that he prefers to go by Joe. Coming to the Smokingpipes shipping department from a very different career, Joe is a veteran of the Air Force, where he worked on survival equipment and evasion tactics. Joe is accompanied by his wife, Lyndsey, and his four-year-old son, Ivan. He loves movies, especially sci-fi, and is a huge fan of Doctor Who.","MANAGER":0,"EMPLOYEE_TITLE":"Shipping & Receiving Associate","DEPARTMENT_NAME":"Shipping","EMAIL":"joe.young@smokingpipes.com","EMPLOYEE_PICTURE":"Joe_Young.jpg","CELL_PHONE":"","ADMIN_ID":1082,"OFFICE_PHONE":105.0,"LASTNAME":"Young"},{"FIRSTNAME":"Vallin","EMPLOYEE_BLURB":"Vallin's first day of work with Smokingpipes also happened to correspond with our monthly birthday and anniversary party. After meeting the entire crew at once, and getting to know us over sandwiches and cake, Vallin determined that he never wants to leave. Born and raised in Longwood, NC, he is 29 years young and a kid at heart. He loves watching cartoons, playing video games, and working on cars -- especially Hondas. He is quite happy to be joining the SPC shipping department.","MANAGER":0,"EMPLOYEE_TITLE":"Shipping & Receiving Associate","DEPARTMENT_NAME":"Shipping","EMAIL":"vallin.williams@smokingpipes.com","EMPLOYEE_PICTURE":"Vallin_Williams.jpg","CELL_PHONE":"","ADMIN_ID":1086,"OFFICE_PHONE":105.0,"LASTNAME":"Williams"},{"FIRSTNAME":"Michael","EMPLOYEE_BLURB":"Originally from Langhorne, PA, Michael moved to Myrtle Beach to be closer to his parents. He was an Operations Specialist in the Navy, working with Tactical Data Systems and as a Tactical Air Controller, having been deployed a number of times to the Persian Gulf, Mediterranean Sea, South America, and Baltic Sea. The wealth of knowledge gained from his education in systems and network administration has lead him to work for businesses small and large, such as hospitals, car dealers, real estate offices, and even Dell. Now that he is at Smokingpipes, however, he has realized a growing interest in pipes and tobacco. When he isn't on the job, Mike spends his time at the beach, playing video games, or with his parents.","MANAGER":1,"EMPLOYEE_TITLE":"Network Administrator","DEPARTMENT_NAME":"Operations","EMAIL":"michael.flanigan@laudisi.com","EMPLOYEE_PICTURE":"Mike_Flanigan.jpg","CELL_PHONE":"215-543-2257","ADMIN_ID":1089,"OFFICE_PHONE":100.0,"LASTNAME":"Flanigan"},{"FIRSTNAME":"Jeremy","EMPLOYEE_BLURB":"A pipe smoker for over 10 years, Jeremy is the perfect guy to help our customers. We're certainly going to take advantage of his experience as a tobacco shop manager, as well as a wood-fire pizza chef. When he isn't smoking his pipe, well, or even while he is, he enjoys the outdoors, particularly camping and hiking. He claims he is an \"adventurous eater,\" and has an expressed love for trying new things and attempting to recreate them in his kitchen at home. Born in Portales, New Mexico, Jeremy is a bit of a rolling stone. He has called Chicago, Denver, Cleveland, and Portland home, before moving to South Carolina, where we hope he will stay.","MANAGER":0,"EMPLOYEE_TITLE":"Customer Service Associate","DEPARTMENT_NAME":"Sales & Customer Service","EMAIL":"jeremy.reeves@smokingpipes.com","EMPLOYEE_PICTURE":"jeremy_Reeves.jpg","CELL_PHONE":"","ADMIN_ID":1090,"OFFICE_PHONE":128.0,"LASTNAME":"Reeves"},{"FIRSTNAME":"Chris","EMPLOYEE_BLURB":"Employed by Cornell & Diehl for over seven years, with an additional three years of prior experience working side-by-side with his father and mentor, Craig Tarler, Chris took over the reins from his parents when they retired. After thirty years in the restaurant industry, when Chris expressed an interest in joining C&D, his father’s immediate remark was “What the hell took you so long?” As C&D’s chief blender, when he’s not experimenting towards the creation of a new mixture, or constantly brushing tobacco fanning off his clothing, his interests include golf, gardening and hanging out with his dog, a rescue named “Con” (short for “Con-Man”).","MANAGER":0,"EMPLOYEE_TITLE":"VP of Manufacturing","DEPARTMENT_NAME":"Cornell & Diehl","EMAIL":"chris.tarler@laudisi.com","EMPLOYEE_PICTURE":"chris_tarler.jpg","CELL_PHONE":"","ADMIN_ID":1088,"OFFICE_PHONE":108.0,"LASTNAME":"Tarler"},{"FIRSTNAME":"Ted","EMPLOYEE_BLURB":"Ted has been with Cornell and Diehl now for over 15 years. His wealth of knowledge gained from working closely with Craig Tarler, and being an integral part of the daily process here at Cornell and Diehl, has made him an indispensable asset to this company. Ted can always be counted on for an encouraging smile and wise words. Outside of Cornell and Diehl, Ted is a gardener extraordinaire and has a deep interest of all things in the sports world. Ted’s biggest priority in life, however, is his family, including his wonderful wife, children and grandchildren.","MANAGER":0,"EMPLOYEE_TITLE":"Head Blender","DEPARTMENT_NAME":"Cornell & Diehl","EMAIL":"ted.connelly@laudisi.com","EMPLOYEE_PICTURE":"Ted_Connelly.jpg","CELL_PHONE":"","ADMIN_ID":1093,"OFFICE_PHONE":"","LASTNAME":"Connelly"},{"FIRSTNAME":"William","EMPLOYEE_BLURB":"William has been here at Cornell and Diehl for nine years. As one of our two blenders, he hand mixes all of our tobacco products in exacting accordance to the myriad of our diverse recipes. When away from C&D, Will spends much of his time with his daughter and grandson, as well in study; Will is working towards being a Paralegal\/Legal Technician and is an ardent student of the human mind and intellect.","MANAGER":0,"EMPLOYEE_TITLE":"Blender","DEPARTMENT_NAME":"Cornell & Diehl","EMAIL":"william.harbison@laudisi.com","EMPLOYEE_PICTURE":"William_Harbison.jpg","CELL_PHONE":"","ADMIN_ID":1094,"OFFICE_PHONE":"","LASTNAME":"Harbison"},{"FIRSTNAME":"Ben","EMPLOYEE_BLURB":"Starting work at C&D shortly after he graduated from high school, Ben has now been with Cornell and Diehl for almost a decade. While Ben has worked almost every job Cornell and Diehl has to offer, he now cuts all of our finished pressed product, works with tinning, and most everything in between. Clearly Ben isn't afraid of hard work; when he isn't here, he is working to remodel his new house, a joy that is second only to spending time and relaxing with friends and family.","MANAGER":0,"EMPLOYEE_TITLE":"Production Associate","DEPARTMENT_NAME":"Cornell & Diehl","EMAIL":"ben.hollifield@laudisi.com","EMPLOYEE_PICTURE":"Ben_Hollifield.jpg","CELL_PHONE":"","ADMIN_ID":1095,"OFFICE_PHONE":"","LASTNAME":"Hollifield"}] 